## Concatenation

In [1]:
import pandas as pd

In [3]:
team={
      'Team Name':['CSK','MI','GT'],
      'Captain Name':['MSD','Rohit','Hardik'],
      'Age':[40,37,35]
}

In [5]:
print(team)
print(type(team))

{'Team Name': ['CSK', 'MI', 'GT'], 'Captain Name': ['MSD', 'Rohit', 'Hardik'], 'Age': [40, 37, 35]}
<class 'dict'>

In [6]:
ipl_team=pd.DataFrame(team)

In [7]:
ipl_team

  Team Name Captain Name  Age
0       CSK          MSD   40
1        MI        Rohit   37
2        GT       Hardik   35

In [17]:
team1={
      'Team Name':['KKR','RCB','LT'],
      'Captain Name':['Nitish Rana','Virat','xyz'],
      'Age':[23,37,35]
}

In [18]:
ipl_team1=pd.DataFrame(team1)

In [19]:
df=pd.concat([ipl_team,ipl_team1])

In [20]:
df

  Team Name Captain Name  Age
0       KKR  Nitish Rana   23
1       RCB        Virat   37
2        LT          xyz   35
0       KKR  Nitish Rana   23
1       RCB        Virat   37
2        LT          xyz   35

In [21]:
df=pd.concat([ipl_team,ipl_team1],ignore_index=True)

In [22]:
df

  Team Name Captain Name  Age
0       KKR  Nitish Rana   23
1       RCB        Virat   37
2        LT          xyz   35
3       KKR  Nitish Rana   23
4       RCB        Virat   37
5        LT          xyz   35